; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v13 ?v1)
             (pred_5 ?v2 ?v11)
             (pred_1 ?v13 ?v11)
             (pred_11 ?v9 ?v13 )
	     (pred_7 ?v13)
             (pred_3 ?v12)
             (pred_6 ?v2)
             (pred_12 ?v11)
             (pred_4 ?v13)
             (pred_8 ?v2)
             (pred_2 ?v13)
             (pred_10 ))



(:action op_4
:parameters (?v10 ?v4 ?v8 ?v7)
:precondition (and (pred_3 ?v10) (pred_3 ?v4) (pred_6 ?v8) (pred_12 ?v7)
          (pred_9 ?v10 ?v4) (pred_5 ?v8 ?v7)
                   (pred_1 ?v4 ?v7) (pred_7 ?v10) 
                   (pred_4 ?v4) (pred_8 ?v8))
:effect (and  (pred_2 ?v4) (not (pred_4 ?v4))))


(:action op_2
:parameters (?v10 ?v6)
:precondition (and (pred_3 ?v10) (pred_3 ?v6)
               (pred_7 ?v10) (pred_9 ?v10 ?v6) (pred_2 ?v6))
:effect (and (pred_7 ?v6) (not (pred_7 ?v10))))

(:action op_1
:parameters (?v10 ?v8)
:precondition (and (pred_3 ?v10) (pred_6 ?v8) 
                  (pred_7 ?v10) (pred_11 ?v8 ?v10) (pred_10 ))
:effect (and (pred_8 ?v8)
   (not (pred_11 ?v8 ?v10)) (not (pred_10 ))))


(:action op_3
:parameters (?v10 ?v3 ?v5)
:precondition (and (pred_3 ?v10) (pred_6 ?v3) (pred_6 ?v5)
                  (pred_7 ?v10) (pred_8 ?v5) (pred_11 ?v3 ?v10))
:effect (and (pred_8 ?v3) (pred_11 ?v5 ?v10)
        (not (pred_8 ?v5)) (not (pred_11 ?v3 ?v10))))

(:action op_5
:parameters (?v10 ?v8)
:precondition (and (pred_3 ?v10) (pred_6 ?v8) 
                  (pred_7 ?v10) (pred_8 ?v8))
:effect (and (pred_10 ) (pred_11 ?v8 ?v10) (not (pred_8 ?v8)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_05 obj_17 obj_20 obj_19 obj_16 obj_14 obj_06 obj_18 obj_15 obj_07 obj_10 obj_08 obj_11 obj_21 obj_13 obj_02
    obj_01 obj_04
    obj_03 obj_12 obj_09
    )

    (:init
       (pred_10)

       (pred_3 obj_05)
       (pred_3 obj_17)
       (pred_3 obj_20)
       (pred_3 obj_19)
       (pred_3 obj_16)
       (pred_3 obj_14)
       (pred_3 obj_06)
       (pred_3 obj_18)
       (pred_3 obj_15)
       (pred_3 obj_07)
       (pred_3 obj_10)
       (pred_3 obj_08)
       (pred_3 obj_11)
       (pred_3 obj_21)
       (pred_3 obj_13)
       (pred_3 obj_02)
       (pred_12 obj_01)
       (pred_12 obj_04)
       (pred_6 obj_03)
       (pred_6 obj_12)
       (pred_6 obj_09)

       (pred_9 obj_05 obj_16)
       (pred_9 obj_05 obj_17)
       (pred_9 obj_17 obj_14)
       (pred_9 obj_17 obj_20)
       (pred_9 obj_17 obj_05)
       (pred_9 obj_20 obj_06)
       (pred_9 obj_20 obj_19)
       (pred_9 obj_20 obj_17)
       (pred_9 obj_19 obj_18)
       (pred_9 obj_19 obj_20)
       (pred_9 obj_16 obj_15)
       (pred_9 obj_16 obj_14)
       (pred_9 obj_16 obj_05)
       (pred_9 obj_14 obj_07)
       (pred_9 obj_14 obj_06)
       (pred_9 obj_14 obj_17)
       (pred_9 obj_14 obj_16)
       (pred_9 obj_06 obj_10)
       (pred_9 obj_06 obj_18)
       (pred_9 obj_06 obj_20)
       (pred_9 obj_06 obj_14)
       (pred_9 obj_18 obj_08)
       (pred_9 obj_18 obj_19)
       (pred_9 obj_18 obj_06)
       (pred_9 obj_15 obj_11)
       (pred_9 obj_15 obj_07)
       (pred_9 obj_15 obj_16)
       (pred_9 obj_07 obj_21)
       (pred_9 obj_07 obj_10)
       (pred_9 obj_07 obj_14)
       (pred_9 obj_07 obj_15)
       (pred_9 obj_10 obj_13)
       (pred_9 obj_10 obj_08)
       (pred_9 obj_10 obj_06)
       (pred_9 obj_10 obj_07)
       (pred_9 obj_08 obj_02)
       (pred_9 obj_08 obj_18)
       (pred_9 obj_08 obj_10)
       (pred_9 obj_11 obj_21)
       (pred_9 obj_11 obj_15)
       (pred_9 obj_21 obj_13)
       (pred_9 obj_21 obj_07)
       (pred_9 obj_21 obj_11)
       (pred_9 obj_13 obj_02)
       (pred_9 obj_13 obj_10)
       (pred_9 obj_13 obj_21)
       (pred_9 obj_02 obj_08)
       (pred_9 obj_02 obj_13)
       (pred_4 obj_19)
       (pred_4 obj_05)
       (pred_4 obj_14)
       (pred_1  obj_19 obj_01)
       (pred_1  obj_05 obj_04)
       (pred_1  obj_14 obj_01)
       (pred_2 obj_17)
       (pred_2 obj_20)
       (pred_2 obj_16)
       (pred_2 obj_06)
       (pred_2 obj_18)
       (pred_2 obj_15)
       (pred_2 obj_07)
       (pred_2 obj_10)
       (pred_2 obj_08)
       (pred_2 obj_11)
       (pred_2 obj_21)
       (pred_2 obj_13)
       (pred_2 obj_02)

       (pred_5  obj_03 obj_01)
       (pred_5  obj_12 obj_04)
       (pred_5  obj_09 obj_01)
       (pred_11 obj_03 obj_10)
       (pred_11 obj_12 obj_06)
       (pred_11 obj_09 obj_17)
       (pred_7 obj_06)
    )

    (:goal (and
       (pred_11 obj_03 obj_11)
       (pred_11 obj_12 obj_16)
       (pred_11 obj_09 obj_20)
    ))
(:constraints
  (always (not (pred_7 obj_14)))
)
)

; plan
1. (op_1 obj_06 obj_12)
   deleted: (pred_11 obj_12 obj_06) (pred_10)
   added: (pred_8 obj_12)
   goals met: 0 of 3
2. (op_2 obj_06 obj_20)
   deleted: (pred_7 obj_06)
   added: (pred_7 obj_20)
   goals met: 0 of 3
3. (op_2 obj_20 obj_17)
   deleted: (pred_7 obj_20)
   added: (pred_7 obj_17)
   goals met: 0 of 3
4. (op_4 obj_17 obj_05 obj_12 obj_04)
   deleted: (pred_4 obj_05)
   added: (pred_2 obj_05)
   goals met: 0 of 3
5. (op_3 obj_17 obj_09 obj_12)
   deleted: (pred_8 obj_12) (pred_11 obj_09 obj_17)
   added: (pred_8 obj_09) (pred_11 obj_12 obj_17)
   goals met: 0 of 3
6. (op_2 obj_17 obj_20)
   deleted: (pred_7 obj_17)
   added: (pred_7 obj_20)
   goals met: 0 of 3
7. (op_5 obj_20 obj_09)
   deleted: (pred_8 obj_09)
   added: (pred_10) (pred_11 obj_09 obj_20)
   goals met: 1 of 3
8. (op_2 obj_20 obj_17)
   deleted: (pred_7 obj_20)
   added: (pred_7 obj_17)
   goals met: 1 of 3
9. (op_1 obj_17 obj_12)
   deleted: (pred_11 obj_12 obj_17) (pred_10)
   added: (pred_8 obj_12)
   goals met: 1 of 3
10. (op_2 obj_17 obj_20)
   deleted: (pred_7 obj_17)
   added: (pred_7 obj_20)
   goals met: 1 of 3
11. (op_2 obj_20 obj_06)
   deleted: (pred_7 obj_20)
   added: (pred_7 obj_06)
   goals met: 1 of 3
12. (op_2 obj_06 obj_10)
   deleted: (pred_7 obj_06)
   added: (pred_7 obj_10)
   goals met: 1 of 3
13. (op_2 obj_10 obj_07)
   deleted: (pred_7 obj_10)
   added: (pred_7 obj_07)
   goals met: 1 of 3
14. (op_5 obj_07 obj_12)
   deleted: (pred_8 obj_12)
   added: (pred_10) (pred_11 obj_12 obj_07)
   goals met: 1 of 3
15. (op_2 obj_07 obj_10)
   deleted: (pred_7 obj_07)
   added: (pred_7 obj_10)
   goals met: 1 of 3
16. (op_1 obj_10 obj_03)
   deleted: (pred_11 obj_03 obj_10) (pred_10)
   added: (pred_8 obj_03)
   goals met: 1 of 3
17. (op_2 obj_10 obj_07)
   deleted: (pred_7 obj_10)
   added: (pred_7 obj_07)
   goals met: 1 of 3
18. (op_3 obj_07 obj_12 obj_03)
   deleted: (pred_8 obj_03) (pred_11 obj_12 obj_07)
   added: (pred_8 obj_12) (pred_11 obj_03 obj_07)
   goals met: 1 of 3
19. (op_2 obj_07 obj_15)
   deleted: (pred_7 obj_07)
   added: (pred_7 obj_15)
   goals met: 1 of 3
20. (op_2 obj_15 obj_16)
   deleted: (pred_7 obj_15)
   added: (pred_7 obj_16)
   goals met: 1 of 3
21. (op_5 obj_16 obj_12)
   deleted: (pred_8 obj_12)
   added: (pred_10) (pred_11 obj_12 obj_16)
   goals met: 2 of 3
22. (op_2 obj_16 obj_15)
   deleted: (pred_7 obj_16)
   added: (pred_7 obj_15)
   goals met: 2 of 3
23. (op_2 obj_15 obj_07)
   deleted: (pred_7 obj_15)
   added: (pred_7 obj_07)
   goals met: 2 of 3
24. (op_1 obj_07 obj_03)
   deleted: (pred_11 obj_03 obj_07) (pred_10)
   added: (pred_8 obj_03)
   goals met: 2 of 3
25. (op_2 obj_07 obj_15)
   deleted: (pred_7 obj_07)
   added: (pred_7 obj_15)
   goals met: 2 of 3
26. (op_2 obj_15 obj_11)
   deleted: (pred_7 obj_15)
   added: (pred_7 obj_11)
   goals met: 2 of 3
27. (op_5 obj_11 obj_03)
   deleted: (pred_8 obj_03)
   added: (pred_10) (pred_11 obj_03 obj_11)
   goals met: 3 of 3
